lab2/lab2_instructions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-04-05 Thu 16:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6941cf7">1. Lab 2</a>
<ul>
<li><a href="#org30e9e80">1.1. Creaing the perfect GPG keypair</a>
<ul>
<li><a href="#org46dbed7">1.1.1. Notice that the following section can be skipped in this lab:</a></li>
<li><a href="#org16ba794">1.1.2. Known issue</a></li>
<li><a href="#org66a60ed">1.1.3. Export public key</a></li>
</ul>
</li>
<li><a href="#org7f4f0c7">1.2. Sign a message using your private key</a>
<ul>
<li><a href="#org4459a02">1.2.1. Create file</a></li>
<li><a href="#org9b2f4dc">1.2.2. Sign the file</a></li>
<li><a href="#org1d13a5f">1.2.3. Submit files</a></li>
</ul>
</li>
<li><a href="#orgec2c542">1.3. Sending an encrypted message to Jerry</a>
<ul>
<li><a href="#org8726229">1.3.1. Find Jerry's GPG public key</a></li>
<li><a href="#orgd4fff97">1.3.2. Verify the GPG fingerprint</a></li>
<li><a href="#org549dba9">1.3.3. Create a message</a></li>
<li><a href="#orgd36618e">1.3.4. Encrypt the message</a></li>
<li><a href="#orga5d4360">1.3.5. Submit the encryted message</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org6941cf7" class="outline-2">
<h2 id="org6941cf7"><span class="section-number-2">1</span> Lab 2</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org30e9e80" class="outline-3">
<h3 id="org30e9e80"><span class="section-number-3">1.1</span> Creaing the perfect GPG keypair</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="https://alexcabal.com/creating-the-perfect-gpg-keypair/">Creating the perfect GPG keypair</a> is a detailed and up-to-date
   article that will guide you through creating your own GPG
   keypair. Please create the GPG according to the article.
</p>
</div>
<div id="outline-container-org46dbed7" class="outline-4">
<h4 id="org46dbed7"><span class="section-number-4">1.1.1</span> Notice that the following section can be skipped in this lab:</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="orgbea2500"></a>Adding a picture<br /></li>
<li><a id="org187d845"></a>In case of emergency<br /></li>
</ol>
</div>
<div id="outline-container-org16ba794" class="outline-4">
<h4 id="org16ba794"><span class="section-number-4">1.1.2</span> Known issue</h4>
<div class="outline-text-4" id="text-1-1-2">
</div>
<ol class="org-ol">
<li><a id="org339a1d6"></a>Not enough entropy<br />
<div class="outline-text-5" id="text-1-1-2-1">
<p>
If you receive a complain like this when trying to generate the GPG key pair:
</p>
<blockquote>
<p>
**We need to generate a lot of random bytes. It is a good idea to perform
some other action (type on the keyboard, move the mouse, utilize the
disks) during the prime generation; this gives the random number
generator a better chance to gain enough entropy.
Not enough random bytes available.  Please do some other work to give
the OS a chance to collect more entropy! (Need 210 more bytes)**
</p>
</blockquote>
<p>
Please try the following steps before generating the key pair again:
</p>
<div class="org-src-container">
<pre class="src src-bash">sudo apt-get install rng-tools
sudo rngd -r /dev/urandom
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-org66a60ed" class="outline-4">
<h4 id="org66a60ed"><span class="section-number-4">1.1.3</span> Export public key</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
Export your public key created in step one as
your<sub>TU</sub><sub>id.public.gpg</sub>-key (for example, zic123.public.gpg-key)
</p>
</div>
</div>
</div>

<div id="outline-container-org7f4f0c7" class="outline-3">
<h3 id="org7f4f0c7"><span class="section-number-3">1.2</span> Sign a message using your private key</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org4459a02" class="outline-4">
<h4 id="org4459a02"><span class="section-number-4">1.2.1</span> Create file</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Create a message named as your<sub>TU</sub><sub>id.txt</sub> (for example, zic123.txt)
which include three lines as follow (your name, your id, your netid):
</p>
<pre class="example">
Jerry Chai
14912345
zic123
</pre>
</div>
</div>

<div id="outline-container-org9b2f4dc" class="outline-4">
<h4 id="org9b2f4dc"><span class="section-number-4">1.2.2</span> Sign the file</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
Sign the .txt file you just created in Step3 (for example, zic123.txt)
with your private key using gpg according to <a href="https://www.gnupg.org/gph/en/manual/x135.html">The GNU Privacy Handbook</a>.
</p>
<div class="org-src-container">
<pre class="src src-shell">gpg --output zic123.txt.sig --sign zic123.txt
</pre>
</div>
</div>
</div>

<div id="outline-container-org1d13a5f" class="outline-4">
<h4 id="org1d13a5f"><span class="section-number-4">1.2.3</span> Submit files</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Upload the following three files (the zic123 here should be your own
TU NetID) to Harvey:
</p>
<pre class="example">
zic123.public.gpg-kep
zic123.txt
zic123.txt.sig
</pre>
</div>
</div>
</div>

<div id="outline-container-orgec2c542" class="outline-3">
<h3 id="orgec2c542"><span class="section-number-3">1.3</span> Sending an encrypted message to Jerry</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org8726229" class="outline-4">
<h4 id="org8726229"><span class="section-number-4">1.3.1</span> Find Jerry's GPG public key</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Jerry's public key is available in the online public key pool. One way
to download it is as follows:
</p>
<div class="org-src-container">
<pre class="src src-shell">[user@email ~]$ gpg --keyserver pool.sks-keyservers.net --search-keys zic337@utulsa.edu
gpg: searching for <span style="color: #9ccc65;">"zic337@utulsa.edu"</span> from hkp server pool.sks-keyservers.net
(1)     Jerry Chai <a href="mailto:zic337%40utulsa.edu">&lt;zic337@utulsa.edu&gt;</a>
          4096 bit RSA key D5E661BE, created: 2017-02-08, expires: 2019-02-08
Keys 1-1 of 1 for <span style="color: #9ccc65;">"zic337@utulsa.edu"</span>.  Enter number(s), N)ext, or Q)uit &gt; 1
gpg: requesting key D5E661BE from hkp server pool.sks-keyservers.net
gpg: lookup_hashtable failed: eof
gpg: key D5E661BE: public key <span style="color: #9ccc65;">"Jerry Chai <a href="mailto:zic337%40utulsa.edu">&lt;zic337@utulsa.edu&gt;</a>"</span> imported
gpg: Total number processed: 1
gpg:               imported: 1  (RSA: 1)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd4fff97" class="outline-4">
<h4 id="orgd4fff97"><span class="section-number-4">1.3.2</span> Verify the GPG fingerprint</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
One should always verify the fingerprint of the GPG before trusting
it. The fingerprint should be gotten from a trusted channel (for
example, through web-of-trust, through the owner's personal website
with HTTPS connection enabled, or through the business card the owner
gave you.)
</p>

<p>
In Lab 2, the fingerprint of Jerry's public key is given through Harvey.
</p>
<div class="org-src-container">
<pre class="src src-shell">[user@email ~]$ gpg --fingerprint zic337@utulsa.edu
pub   4096R/D5E661BE 2017-02-08 [expires: 2019-02-08]
      Key fingerprint = 9172 A93E 82BA 3841 FFAC  6266 8638 1DC8 D5E6 61BE
uid                  Jerry Chai <a href="mailto:zic337%40utulsa.edu">&lt;zic337@utulsa.edu&gt;</a>
sub   4096R/44805C51 2017-02-08 [expires: 2019-02-08]
</pre>
</div>
</div>
</div>

<div id="outline-container-org549dba9" class="outline-4">
<h4 id="org549dba9"><span class="section-number-4">1.3.3</span> Create a message</h4>
<div class="outline-text-4" id="text-1-3-3">
</div>
<ol class="org-ol">
<li><a id="orgf77edc8"></a>File name<br />
<div class="outline-text-5" id="text-1-3-3-1">
<p>
Create a file named your<sub>TU</sub><sub>id.txt</sub>. For example, if abc123 is your
TU<sub>id</sub>, then the file should be called abc123.txt.  Please do not use
any other form as the file name. Examples of common BAD file names
include: 1491321.txt, CS.txt, i<sub>do</sub><sub>not</sub><sub>care.txt</sub>.
</p>
</div>
</li>

<li><a id="org3c2474d"></a>Content in the file<br />
<div class="outline-text-5" id="text-1-3-3-2">
<p>
There should be two lines in your file. The first line is "The meaning
of life is 42.".  The second line is "Name: Your Name". Please include
the string "Name: " on your second line.
</p>
<div class="org-src-container">
<pre class="src src-shell">[user@email ~]$ cat zic337.txt
The meaning of life is 42.
Name: Jerry Chai
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgd36618e" class="outline-4">
<h4 id="orgd36618e"><span class="section-number-4">1.3.4</span> Encrypt the message</h4>
<div class="outline-text-4" id="text-1-3-4">
<div class="org-src-container">
<pre class="src src-shell">[user@email ~]$ gpg -r zic337@utulsa.edu --encrypt your_TU_id.txt
gpg: lookup_hashtable failed: eof
gpg: lookup_hashtable failed: eof
gpg: 44805C51: There is no assurance this key belongs to the named user

pub  4096R/44805C51 2017-02-08 Jerry Chai <a href="mailto:zic337%40utulsa.edu">&lt;zic337@utulsa.edu&gt;</a>
 Primary key fingerprint: 9172 A93E 82BA 3841 FFAC  6266 8638 1DC8 D5E6 61BE
      Subkey fingerprint: 2AC0 259D A78A 620F 4265  A529 D2F7 6A9C 4480 5C51

It is NOT certain that the key belongs to the person named
<span style="color: #fff59d;">in</span> the user ID.  If you *really* know what you are doing,
you may answer the next question with yes.

Use this key anyway? (y/N) y
</pre>
</div>
</div>
</div>

<div id="outline-container-orga5d4360" class="outline-4">
<h4 id="orga5d4360"><span class="section-number-4">1.3.5</span> Submit the encryted message</h4>
<div class="outline-text-4" id="text-1-3-5">
<p>
After executing the command line above, you should get a file called
"your<sub>TU</sub><sub>id.txt.gpg</sub>".
</p>
<div class="org-src-container">
<pre class="src src-shell">[user@email ~]$ ls -l zic123.txt.gpg
-rw-rw-r-- 1 user user 600 Apr  5 15:28 zic123.txt.gpg
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-04-05 Thu 16:14</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
